### 데이터프레임의 데이터 조작

In [1]:
import numpy as np 
import pandas as pd

#### 데이터 갯수 세기

In [2]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [3]:
s.count()

9

In [4]:
np.random.seed(2020)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  3.0
1  3.0  3.0  0.0  0.0
2  0.0  0.0  2.0  NaN
3  3.0  3.0  2.0  3.0

In [5]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [6]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [7]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [16]:
titanic['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

#### 카테고리 값 세기

In [8]:
np.random.seed(2020)
s2 = pd.Series(np.random.randint(6, size=100))
s2.tail()

95    5
96    5
97    5
98    2
99    2
dtype: int32

In [9]:
s2.value_counts()

0    20
3    18
2    17
1    17
5    16
4    12
dtype: int64

In [10]:
df[0].value_counts()

3.0    2
0.0    2
Name: 0, dtype: int64

#### 정렬

In [11]:
s2.value_counts().sort_index()

0    20
1    17
2    17
3    18
4    12
5    16
dtype: int64

In [12]:
s.sort_values()

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [13]:
s.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

In [14]:
df.sort_values(by=1)

     0    1    2    3
0  0.0  0.0  3.0  3.0
2  0.0  0.0  2.0  NaN
1  3.0  3.0  0.0  0.0
3  3.0  3.0  2.0  3.0

In [15]:
df.sort_values(by=[1,2])

     0    1    2    3
2  0.0  0.0  2.0  NaN
0  0.0  0.0  3.0  3.0
1  3.0  3.0  0.0  0.0
3  3.0  3.0  2.0  3.0

#### 행/열 합계

In [17]:
np.random.seed(2020)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2

   0  1  2  3  4  5  6  7
0  0  8  3  6  3  3  7  8
1  0  0  8  9  3  7  2  3
2  6  5  0  4  8  6  4  1
3  1  5  9  5  6  6  6  5

In [18]:
df2.sum(axis=1)

0    38
1    32
2    34
3    43
dtype: int64

In [21]:
df2.sum()

0           7
1          18
2          20
3          24
4          20
5          22
6          19
7          17
RowSum    147
dtype: int64

In [20]:
df2['RowSum'] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  0  8  3  6  3  3  7  8      38
1  0  0  8  9  3  7  2  3      32
2  6  5  0  4  8  6  4  1      34
3  1  5  9  5  6  6  6  5      43

In [22]:
df2.loc['ColTotal', :] = df2.sum()
df2

            0     1     2     3     4     5     6     7  RowSum
0         0.0   8.0   3.0   6.0   3.0   3.0   7.0   8.0    38.0
1         0.0   0.0   8.0   9.0   3.0   7.0   2.0   3.0    32.0
2         6.0   5.0   0.0   4.0   8.0   6.0   4.0   1.0    34.0
3         1.0   5.0   9.0   5.0   6.0   6.0   6.0   5.0    43.0
ColTotal  7.0  18.0  20.0  24.0  20.0  22.0  19.0  17.0   147.0

In [29]:
# 연습 문제 4.4.3
# 1. 타이타닉호 승객의 평균 나이를 구하라.
round(titanic['age'].mean(), 2)

29.7

In [30]:
# 2. 타이타닉호 승객중 여성 승객의 평균 나이를 구하라.
t2 = titanic[titanic['sex'] == 'female']
round(t2['age'].mean(), 2)

27.92

In [32]:
titanic[titanic.sex == 'female'].age.mean()

27.915708812260537

In [37]:
# 3. 타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.
t3 = titanic[(titanic['class'] == 'First') & (titanic['sex'] == 'female')]
round(t3['age'].mean(), 2)

34.61

In [41]:
titanic[(titanic['class'] == 'First') & (titanic.sex == 'female')].age.mean()

34.61176470588235

In [25]:
titanic['age'].groupby(titanic['sex']).mean()

sex
female    27.915709
male      30.726645
Name: age, dtype: float64

In [26]:
titanic['age'].groupby([titanic['sex'], titanic['class']]).mean()

sex     class
female  First     34.611765
        Second    28.722973
        Third     21.750000
male    First     41.281386
        Second    30.740707
        Third     26.507589
Name: age, dtype: float64

#### apply 변환

In [42]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [43]:
df3.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [44]:
df3.apply(lambda x: x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [45]:
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [46]:
titanic["adult/child"] = titanic.apply(lambda r: "adult" if r.age >= 20 else "child", axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [49]:
# 연습문제 4.4.4
titanic['category1'] = titanic.apply(lambda r: r.sex if r.age >= 20 else 'child', axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

#### fillna 메서드

In [50]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [52]:
# 연습 문제 4.4.5
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

In [55]:
titanic['age'] = titanic['age'].fillna(titanic['age'].mean())
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
886,0,2,male,27.000000,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19.000000,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,29.699118,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.000000,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32.000000,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

#### astype 메서드

In [56]:
df3.apply(pd.value_counts).fillna(0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [57]:
df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

In [59]:
# 연습 문제 4.4.6
titanic['category2'] = titanic['sex'] + titanic['age'].astype(int).astype(str)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1,category2
886,0,2,male,27.000000,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult,male,male27
887,1,1,female,19.000000,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,child,female19
888,0,3,female,29.699118,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,child,female29
889,1,1,male,26.000000,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult,male,male26
890,0,3,male,32.000000,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult,male,male32

#### 실수 값을 카테고리 값으로 변환

In [63]:
ages = [0, 1, 10, 20, 23, 37, 31, 61, 20, 41, 32, 100]

In [64]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, NaN, 미성년자, 미성년자, 청년, ..., 장년, 미성년자, 중년, 중년, 노년]
Length: 12
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]

In [65]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [66]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [67]:
cats.codes

array([-1, -1,  0,  0,  1,  2,  2,  3,  0,  2,  2,  4], dtype=int8)

In [68]:
df4 = pd.DataFrame(ages, columns=["ages"])
df4["age_cat"] = pd.cut(df4.ages, bins, labels=labels)
df4

    ages age_cat
0      0     NaN
1      1     NaN
2     10    미성년자
3     20    미성년자
4     23      청년
5     37      중년
6     31      중년
7     61      장년
8     20    미성년자
9     41      중년
10    32      중년
11   100      노년

In [69]:
df4.age_cat.astype(str) + df4.ages.astype(str)

0       nan0
1       nan1
2     미성년자10
3     미성년자20
4       청년23
5       중년37
6       중년31
7       장년61
8     미성년자20
9       중년41
10      중년32
11     노년100
dtype: object

In [70]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
cats

[Q2, Q1, Q4, Q2, Q3, ..., Q1, Q3, Q3, Q1, Q2]
Length: 1000
Categories (4, object): [Q1 < Q2 < Q3 < Q4]

In [71]:
pd.value_counts(cats)

Q4    250
Q3    250
Q2    250
Q1    250
dtype: int64

In [72]:
cats.value_counts()

Q1    250
Q2    250
Q3    250
Q4    250
dtype: int64